** Second derivatives - pairs of coordinates that equal a1g

#+BEGIN_SRC python :results output
import numpy as np
A1g = 	np.array([+1,	+1,	+1,	+1,	+1,	+1,	+1,	+1])
B1g = 	np.array([+1,	+1,	-1,	-1,	+1,	+1,	-1,	-1])
B2g = 	np.array([+1,	-1,	+1,	-1,	+1,	-1,	+1,	-1])
B3g = 	np.array([+1,	-1,	-1,	+1,	+1,	-1,	-1,	+1])
A1u = 	np.array([+1,	+1,	+1,	+1,	-1,	-1,	-1,	-1])
B1u = 	np.array([+1,	+1,	-1,	-1,	-1,	-1,	+1,	+1])
B2u = 	np.array([+1,	-1,	+1,	-1,	-1,	+1,	-1,	+1])
B3u = 	np.array([+1,	-1,	-1,	+1,	-1,	+1,	+1,	-1])

funcs = [A1g, A1g, B3g, B2g, B1u, B1u, B2u, B3u, B2u, B3u]
ans = []
for i in range(len(funcs)):
    for j in range(len(funcs)):
	for k in range(len(funcs)):
	    if np.array_equal(funcs[i] * funcs[j] * funcs[k], 
		    [1, 1, 1, 1, 1, 1, 1, 1]) and i !=  j and i != k and j!= k:
		pans = [i+1, j+1, k+1]
		if pans not in ans:
		    ans.append(pans)
for line in ans:
    print line
#+END_SRC 

#+RESULTS:
#+begin_example
[1, 5, 6]
[1, 6, 5]
[1, 7, 9]
[1, 8, 10]
[1, 9, 7]
[1, 10, 8]
[2, 5, 6]
[2, 6, 5]
[2, 7, 9]
[2, 8, 10]
[2, 9, 7]
[2, 10, 8]

#+end_example

ignore ones with 1,2
[3, 5, 7]
[3, 5, 9]
[3, 6, 7]
[3, 6, 9]
[4, 5, 8]
[4, 5, 10]
[4, 6, 8]
[4, 6, 10]

fourth
3 4 7 8
3 4 7 10
3 4 8 9
3 4 9 10

